'''
多级菜单
-三级菜单
-可依次选择进入各子菜单
-所需新知识点：列表、字典
'''
city_dict = {
	"北京":{
		"朝阳区": ["国贸", "望京", "三里屯"],
		"海淀区": ["五道口", "中关村", "学院路"],
		"昌平区": ["沙河", "天通苑", "回龙观"]
	},
	"上海": {
		"静安区": ["静安寺", "梅恒泰", "大中里太古城"],
		"黄浦区": ["人民广场", "外滩", "豫园"],
		"徐汇区": ["中山公园", "天山路商圈", "古北路商圈"]
	},
	"香港": {
		"旺仔": ["铜锣湾", "跑马地", "大坑"],
		"油尖旺": ["尖沙咀", "旺角", "佐敦"],
		"西贡": ["清水湾", "将军澳", "北潭涌"]
	}
}
print(city_dict.keys())
#print(city_dict["北京"]["朝阳"][0])
#print(city_dict["北京"]["朝阳"][1])
#print(city_dict["北京"]["朝阳"][2])